In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("pagamentos.csv", sep=",", header=None)
df.columns = ["cd_cliente", "dt_pagamento", "vl_pagamento", "plano"]
df.dropna()
df.head(10)

   cd_cliente dt_pagamento vl_pagamento      plano
0        4049   05/03/2017    R$ 300,00   Bronze/3
1        1711   12/08/2018    R$ 750,00     Ouro/3
2        3643   01/01/2017    R$ 399,00  Platina/1
3        4683   09/06/2017   R$ 2394,00  Platina/6
4        4645   25/04/2018    R$ 250,00     Ouro/1
5         889   02/07/2019    R$ 250,00     Ouro/1
6        3782   04/02/2018    R$ 300,00   Bronze/3
7        2871   16/09/2017    R$ 600,00   Bronze/6
8        1308   19/05/2017    R$ 399,00  Platina/1
9         328   07/07/2018    R$ 399,00  Platina/1

In [3]:
datas = df.dt_pagamento.str.split(pat="/", expand=True).astype("int")
datas.columns = ["dia_pagamento", "mes_pagamento", "ano_pagamento"]
datas.head()

   dia_pagamento  mes_pagamento  ano_pagamento
0              5              3           2017
1             12              8           2018
2              1              1           2017
3              9              6           2017
4             25              4           2018

In [4]:
df = pd.concat([df, datas], axis=1)
del datas
df.head()

,cd_cliente,dt_pagamento,vl_pagamento,plano,dia_pagamento,mes_pagamento,ano_pagamento
0,4049,05/03/2017,"R$ 300,00",Bronze/3,5,3,2017
1,1711,12/08/2018,"R$ 750,00",Ouro/3,12,8,2018
2,3643,01/01/2017,"R$ 399,00",Platina/1,1,1,2017
3,4683,09/06/2017,"R$ 2394,00",Platina/6,9,6,2017
4,4645,25/04/2018,"R$ 250,00",Ouro/1,25,4,2018

In [5]:
plano = df.plano.str.split(pat="/", expand=True)
plano.columns = ["tp_plano", "periodicidade"]
plano["periodicidade"] = plano.periodicidade.astype("int")
plano["tp_plano"] = plano.tp_plano.astype("category")
plano.head()

  tp_plano  periodicidade
0   Bronze              3
1     Ouro              3
2  Platina              1
3  Platina              6
4     Ouro              1

In [6]:
df = pd.concat([df, plano], axis=1)
del plano
df.head()

,cd_cliente,dt_pagamento,vl_pagamento,plano,dia_pagamento,mes_pagamento,ano_pagamento,tp_plano,periodicidade
0,4049,05/03/2017,"R$ 300,00",Bronze/3,5,3,2017,Bronze,3
1,1711,12/08/2018,"R$ 750,00",Ouro/3,12,8,2018,Ouro,3
2,3643,01/01/2017,"R$ 399,00",Platina/1,1,1,2017,Platina,1
3,4683,09/06/2017,"R$ 2394,00",Platina/6,9,6,2017,Platina,6
4,4645,25/04/2018,"R$ 250,00",Ouro/1,25,4,2018,Ouro,1

In [7]:
df["vl_pagamento"] = df.vl_pagamento.str.split().str[-1]
df["vl_pagamento"] = df.vl_pagamento.str.replace(",", ".", regex=False).astype("float")
df.head()

,cd_cliente,dt_pagamento,vl_pagamento,plano,dia_pagamento,mes_pagamento,ano_pagamento,tp_plano,periodicidade
0,4049,05/03/2017,300.0,Bronze/3,5,3,2017,Bronze,3
1,1711,12/08/2018,750.0,Ouro/3,12,8,2018,Ouro,3
2,3643,01/01/2017,399.0,Platina/1,1,1,2017,Platina,1
3,4683,09/06/2017,2394.0,Platina/6,9,6,2017,Platina,6
4,4645,25/04/2018,250.0,Ouro/1,25,4,2018,Ouro,1

In [8]:
df = df.drop(columns=["dt_pagamento", "plano"])
df.head(10)

,cd_cliente,vl_pagamento,dia_pagamento,mes_pagamento,ano_pagamento,tp_plano,periodicidade
0,4049,300.0,5,3,2017,Bronze,3
1,1711,750.0,12,8,2018,Ouro,3
2,3643,399.0,1,1,2017,Platina,1
3,4683,2394.0,9,6,2017,Platina,6
4,4645,250.0,25,4,2018,Ouro,1
5,889,250.0,2,7,2019,Ouro,1
6,3782,300.0,4,2,2018,Bronze,3
7,2871,600.0,16,9,2017,Bronze,6
8,1308,399.0,19,5,2017,Platina,1
9,328,399.0,7,7,2018,Platina,1

In [9]:
df.dtypes

cd_cliente          int64
vl_pagamento      float64
dia_pagamento       int64
mes_pagamento       int64
ano_pagamento       int64
tp_plano         category
periodicidade       int64
dtype: object

In [10]:
from sqlalchemy import create_engine

engine = create_engine("postgresql://postgres:postgres@191.252.184.52:5432/mrr")

In [11]:
df.to_sql("pagamento", con=engine, schema="stage", method="multi", if_exists="replace")